Repository: radicelle/resume
Catalog: lib/l10n/intl_*.arb
Languages: fr

# radicelleTile1
source: Full stack multiplatform with Flutter
fr: Full stack multiplateforme avec Flutter

# radicelleTile1Desc
source: I realized the app I was building had more potential if it was to be in Flutter so I learned and reworked it with Flutter and it was the right choice. I am now working on a stack MVVM architecture and I am planning to learn Go to get replace Ktor with Gin.
fr: Je me suis rendu compte que construire un application avec Flutter serait plus simple et plus efficace qu'avec Kotlin, j'ai donc appris Dart et Flutter. Aujourd'hui je revois le design system de l'application et j'apprends Go pour passer de Ktor vers Gin.

# radicelleTile2Desc
source: I founded Radicelle and bought a few domain names. It will be series of web platforms willing to ease ”neo rural” people in selling agricultural products, develop their production systems and boost their local distribution by proposing simple and affordable services. Its stack is: •Frontend: ReactJS eased by Material-UI •Database: KMongo on mongo Altas (cloud) •Backend : Ktor for Kotlin microservices and Kotlinx Serialization •Build: Gradle with Kotlin gradle DSL
fr: J'ai fondé Radicelle et acheté quelques noms de domaine. Ce sera une série de logiciels pour aider les "neo ruraux" dans la distribution de leur produit agricoles principalement. Mais aussi développer leur système de production et booster la distribution locale avec un service simple et peu onéreux. La stack est : •Frontend: ReactJS facilité par Material-UI •Base de données: KMongo sur mongo Altas (cloud) •Backend : Ktor pour Kotlin microservices et Kotlinx Serialization •Build: Gradle avec Kotlin gradle DSL

# eureciaTile
source: Full stack Web developer
fr: Developpeur Full stack Web

# eureciaTileDesc
source: Carrying out three main tasks : 1) Maintaining java over struts + jsp legacy eurecia.com platform code. 2) Developing new features using REST API with Java and lately Kotlin (including spec challenging). 3) Developing VueJS components calling the REST APIs we created. We had to deal with legacy JSP struts architecture. Using Spring annotations and sometimes plain SQL to communicate whit a MariaDB database, my team and I were responsible for the optimization ROI to be acceptable and performances of the code to be production grade.
fr: Trois tâches principales : 1) Maintenir le code legacy java sur Struts + jsp de la plateforme eurecia.com. 2) Developper des nouveautés avec des services REST en Java puis Kotlin. 3) Développer des composants VueJs en utilisant les API créées à cet effet. Utilisation d'annotation Java et Kotlin ou SQL/Scripts mongo pour la communication avec les bases de données MariaDB ou MongoDB. Responsabilité dans la réalisation, optimisation et le déployement des modules en production avec un service qualité.

# artalTile
source: Full stack Eclipse RCP developer
fr: Developpeur Full stack Eclipse RCP

# artalTileDesc
source: Software development for Airbus model simulation process: Creation of front-end components using Nebula Nattables and Sirius Plugin for instance. Participation in the migration from CDO to Hibernate persistence framework. Creation and optimization of JPA queries to retrieve data in back-end. Strong knowledge in modular development.
fr: Développement Java 8 pour Airbus : Développement de plugins Eclipse RCP avec frontend Nattable ou Sirius. Participation de la migration de la persistence CDO vers hibernate. Création et optimisation de requêtes JPA pour recevoir les données en back-end. Advanced modular programming.

# internshipTile
source: Scholar 6 month internship at Bosch
fr: Projet de fin d'étude (stage) 6 mois chez Bosch

# internshipTileDesc
source: Internship during 6 month in germany performing Ecplise RCP in java strongly bound with XML for automotive controller test platforms development.
fr: Stage en Allemagne durant 6 mois en développement Eclipse RCP, fortement lié à XML pour le développement de bancs de tests pour les contrôleurs automobiles.

# sinceYearMonth
source: Since {date}
fr: Depuis {date}

# entered
source: Entered {institution}
fr: Entrée à {institution}

# tileTooltip
source: Click for details
fr: Cliquez pour plus de détails

source: Master's degree
fr: Master

source: Computer sciences
fr: Informatique

source: Technical degree
fr: DUT

# graduate
source: graduate from {institution}
fr: diplômé de {institution}

source: and
fr: et

source: beginner
fr: débutant

source: fluent
fr: courant

source: mother tongue
fr: langue maternelle

# month
source: {count, plural, =0{zero month} =1{one month} other{{count} months}}
fr: {count, plural,=0{zero mois} =1{un mois} other{{count} mois}}

# year
source: {count, plural, =0{zero year} =1{one year} other{{count} years}}
fr: {count, plural, =0{zero années} =1{une année} other{{count} années}}

# day
source: {count, plural, =0{zero day} =1{one day} other{{count} days}}
fr: {count, plural, =0{zero jours} =1{un jour} other{{count} jours}}

source: and a half
fr: et demi

source: scholarship
fr: d'études

source: internship
fr: de stage

source: english
fr: anglais

source: german
fr: allemand

source: italian
fr: italien

source: italy
fr: italie

source: french
fr: français

source: japanese
fr: japonaise

# livingIn
source: living in {country}
fr: à vivre en {country}

source: photography
fr: photographie

source: apnea
fr: apnée

source: fin swiming
fr: palmes

source: video games
fr: jeux vidéos

# animation
source: {name} animation
fr: animation {name}

source: crafts
fr: bricolage

source: running
fr: course à pied

source: hiking
fr: randonnée

source: grow organic food
fr: faire pousser du bio

# zetIncluded
source: zetetic included
fr: zététique incluse
